/************************************************************************/
/* システム名   : 無呼吸判定											*/
/* ファイル名   : sys.h													*/
/* 機能         : システム共通(マクロ定義、型定義、関数の外部参照宣言)	*/
/* 変更履歴     : 2017.07.12 Axia Soft Design mmura	初版作成			*/
/* 注意事項     : なし                                                  */
/************************************************************************/
#ifndef		_SYS_H_			/* 二重定義防止 */
#define		_SYS_H_

/************************************************************/
/* マクロ													*/
/************************************************************/
/* 汎用定義 */

#define		OFF					(0)							/* オフ					*/
#define		ON					(1)							/* オン					*/

#define		OK					(0)							/* 正常					*/
#define		NG					(1)							/* 異常					*/

#define		TRUE				(1)							/* 真					*/
#define		FALSE				(0)							/* 偽					*/

#define		VALID				(0)							/* 有効					*/
#define		INVALID				(-1)						/* 無効					*/

#define		LOW					(0)							/* ポート生データLOW	*/
#define		HIGH				(1)							/* ポート生データHIGH	*/

#define		ACT_L				(0)							/* ポート論理(LOW)	*/
#define		ACT_H				(1)							/* ポート論理(HIGH)	*/

#define		SET					(1)							/* セット	*/
#define		CLR					(0)							/* クリア	*/

#if !defined(NULL)
#define	NULL	(0)
#endif

/************************************************************/
/* 型定義													*/
/************************************************************/
/* 変数型の再定義 */
typedef signed char		B;		/* 符号付き8ビット整数 */
typedef unsigned char	UB;		/* 符号無し8ビット整数 */
typedef signed short	H;		/* 符号付き16ビット整数 */
typedef unsigned short 	UH;		/* 符号無し16ビット整数 */
typedef signed long		W;		/* 符号付き32ビット整数 */
typedef unsigned long	UW;		/* 符号無し32ビット整数 */

/* 32bit環境から移植したため、32bitサイズとする */
typedef signed long		INT;	/* プロセッサに自然なサイズの符号付き整数 */

typedef unsigned int	UINT;	/* プロセッサに自然なサイズの符号無し整数 */
typedef int				BOOL;	/* 真偽値(TRUE or FALSE) */
typedef float 			FLOAT;	/* 単精度浮動小数点 */
typedef double			DOUBLE;	/* 倍単精度浮動小数点 */
typedef int				ER;		/* 汎用エラー(μiTRON表記) */


/************************************************************/
/* 外部参照宣言												*/
/************************************************************/

#endif
/************************************************************/
/* END OF TEXT												*/
/************************************************************/


